
  // В книге достаточно плохой перевод у вопросов кроссворда, поэтому я предлагаю свои вопросы:
  // В скобках указывается, на каком языке должен быть ответ

  По вертикали: 
	  	1) Многократно исполняемая последовательность инструкций (Рус) 
		2) Упорядоченный набор элементов, каждый из которых хранит одно значение (Рус) 
		3) Cтрого типизированный объектно-ориентированный язык программирования (Eng) 
		4) Числовой тип переменной (Eng) 
		5) Набор операторов, который выполняют определенную задачу и возвращают результат (Рус) 
		6) Модификатор, указывающий на привязку субъекта к текущему классу. (Eng) 
		7) Программа, которая переводит код, написанный на языке программирования, в набор машинных кодов (Рус) 
		8) Величина, имеющая имя, значение и тип (Рус) 
		9) Имя цикла, который выполняется пока заданное выражение правда (Eng) 

  По горизонтали: 
	  	10) Место для ввода команд [ ____ строка] (Рус) 
		11) Тип метода, который не производят возврат каких-либо значений (Eng) 
		12) Тип переменной содержащий последовательность символов (Рус) 
		15) Алгоритмическая конструкция, в осуществляющая выбор той или иной последовательности действий (Рус) 
		16) Что бы использовать переменную, надо ее _____ (Рус) 
		17) Модификатор, указывающий на то, что весь код может получить доступ к классу, полю и др.. (Eng) 
		18) Аббревиатура от "Интегральная схема" (Eng)

  // Фуф, это было сложно